<?php
  // 2.17 В массиве А(N) подсчитать количество элементов, встречающихся более одного раза.

  $masA=[-1,-2,-3,4,5,6,7,8,9,0,9,8,7,10,-30,20];

  $i=0;
  echo "Исходный массив:";
  while($masA[$i]>0 || $masA[$i]<0 || $masA[$i]===0)
  {
    $count++;
    echo "$masA[$i] | ";
    $i++;
  }

  $j=0;
  for($i=0;$i<$count;$i++)
  {
    $masB[$j] = $masA[$i];
    $j++;
  }
  for($i=0;$i<$count;$i++)
  {
      for($j=0;$j<$count;$j++)
      {
        if($masB[$j]==$masA[$i]) $k++;
      }
      if($k>1) $cnt++;
      $k=0;
  }
  $cnt=($cnt/2)%10;
  echo "<br> Количество элементов, встречающихся более одного раза $cnt";

?>
