<?php
  // 2.17 В массиве А(N) подсчитать количество элементов, встречающихся более одного раза.

  $masA=[3,5,6,6,6,3,2,8,5,9,88,11,12,9,88];

  echo "Исходный массив: ";
  for($i=0;$i<999;$i++)
  {
    echo "$masA[$i] | ";
    $count++;
    if($masA[$i+1]=="") break;
  }

  $j=0;
  for($i=0;$i<$count;$i++)
  {
    $masB[$j] = $masA[$i];
    $j++;
  }
  for($i=0;$i<$count;$i++)
  {
      for($j=0;$j<$count;$j++)
      {
        if($masB[$j]==$masA[$i]) $k++;
      }
      if($k>1) $cnt++;
      $k=0;
  }
  $cnt=($cnt/2)%10;
  echo "<br> Количество элементов, встречающихся более одного раза $cnt";

?>
