<?php
  // 2.22 В массиве А(N) найти максимальный из элементов, встречающихся только один раз.

  $masA=[3,5,6,10,6,3,81,5,95,444,41233,25,34,6,4,7,58,67,1,23,2,54,10,34,64,41233];

  $i=0;
  echo "Исходный массив:";
  while($masA[$i]>0 || $masA[$i]<0 || $masA[$i]===0)
  {
    $cnt++;
    echo "$masA[$i] | ";
    $i++;
  }

  for($i=0;$i<$cnt;$i++)
  {
    $masB[$i] = $masA[$i];
  }
  for($i=0;$i<$cnt;$i++)
  {
    for($j=0;$j<$cnt;$j++)
      {
        if($masB[$j]==$masA[$i]) $k++;
      }
      if($k==1)
      {
        if($masA[$i]>$max) $max = $masA[$i];
        $count++;
      }
      $k=0;
  }
  echo "<br>Максимальный из элементов, встречающихся только один раз - $max";
?>
