<?php
  // 2.26 В массив А(N) вставить максимальный элемент после каждого четного отрицательного элемента

  $mas=[1,4,5,-2,6,0,-6,213,7,-485,8229,-324,-546,-22,-8,473,-54,-34,2,-3,-5,1,1,1,1,1,-11,1,2,3,4,5,];
  $i=0;
  echo "Исходный массив:";
  while($mas[$i]>0 || $mas[$i]<0 || $mas[$i]===0)
  {
    $count++;
    echo "$mas[$i] | ";
    $i++;
    if($mas[$i]>$num)
    {
      $num = $mas[$i];
      $posMax=$i;
    }
  }
  $max = $num;

  for($i=0;$i<$count;$i++)
  {
    if($i%2==0 && $mas[$i]<0)
    {
      $masNew[]=$mas[$i];
      $masNew[] = $max;
      $cnt++;
    }
    else {
   $masNew[]=$mas[$i];
   }
    $cnt++;
  }

  echo "<br>Измененный массив:";
  for($i=0;$i<$cnt;$i++)
  {
    echo "$masNew[$i] | ";
  }
?>
