<?php
  /*2.7 В массиве А(N) найти номер элемента, сумма которого со следующим
  за ним элементом максимальна, и номер элемента, сумма которого с
  предыдущим элементом минимальна*/
  $mas=[11,2,3,4,5,6,7,8,9,10,52,741,963,79,654,13,7411];

  echo "Исходный массив: ";
  for($i=0;$i<999;$i++)
  {
    echo "$mas[$i] | ";
    $count++;
    if($mas[$i+1]=="") break;
  }
  $max=0;$min=$count;
  for($i=0;$i<$count;$i++)
  {
    if($mas[$i]+$mas[$i+1]>$max)
    {
      $max = $mas[$i]+$mas[$i+1];
      $positionMax = $i;
    }
    if($mas[$i]+$mas[$i-1]<$min)
    {
      $min = $mas[$i]+$mas[$i-1];
      $positionMin = $i;
    }
  }
  echo "<br>Номер максимального элемента - $positionMax. Сумма = $max";
  echo "<br>Номер минимального элемента - $positionMin. Сумма = $min";
?>
