<?php
  // 2.9 В массиве А(N) найти максимальный среди четных элементов и минимальный среди нечетных.

  $mas=[12123,2123,3123,4123,1235,1236,1237,8123,2913,11230];

  echo "Исходный массив: ";
  for($i=0;$i<999;$i++)
  {
    echo "$mas[$i] | ";
    $count++;
    if($mas[$i]>$num)
    {
      $num=$mas[$i];
    }
    if($mas[$i+1]=="") break;
  }

  $max=0;$min=$num;
  for($i=0;$i<$count;$i++)
  {
    echo "$mas[$i] | ";
    if($i%2==0)
    {
      if($mas[$i]>$max) $max = $mas[$i];
    }
    else {
      if($mas[$i]<$min) $min = $mas[$i];
    }
  }
  echo "<br>Максимальный среди четных $max.<br>Минимальный среди нечетных $min";
?>
