<?php
  // 2.9 В массиве А(N) найти максимальный среди четных элементов и минимальный среди нечетных.

  $mas=[10,20,30,4,50,60,700,80,9,100,220];

  $i=0;
  echo "Исходный массив:";
  while($mas[$i]>0 || $mas[$i]<0 || $mas[$i]===0)
  {
    $count++;
    echo "$mas[$i] | ";
    $i++;
    if($mas[$i]>$num)
    {
      $num = $mas[$i];
      $posMax=$i;
    }
  }
  $max = 0;$min=$num;

  for($i=0;$i<$count;$i++)
  {
    if($i%2==0)
    {
      if($mas[$i]>$max) $max = $mas[$i];
    }
    else {
      if($mas[$i]<$min) $min = $mas[$i];
    }
  }
  echo "<br>Максимальный среди четных $max.<br>Минимальный среди нечетных $min";
?>
